package by.training.inroduction_to_java_online.programming_with_classes.aggregation_and_composition.task03;

public class Logic {
	private String[][] regions = {{"Брестская","Гродненская","Витебская",
			"Могилевская","Гомельская","Минская"},
			{"Брест","Гродно","Витебск","Могилев","Гомель","Минск"}};
	private String[][][] districts = {{
		{"Барановичский","Берёзовский","Брестский","Ганцевичский",
			"Дрогичинский","Жабинковский","Ивановский","Ивацевичский","Каменецкий","Кобринский",
			"Лунинецкий","Ляховичский","Малоритский","Пинский","Пружанский","Столинский"},
		{"Щучинский","Сморгонский","Слонимский","Свислочский","Островецкий","Ошмянский",
			"Новогрудский","Мостовский","Лидский","Кореличский","Ивьевский","Зельвенский",
			"Дятловский","Гродненский","Вороновский","Волковысский","Берестовицкий"},
		{"Шумилинский","Шарковщинский","Чашникский","Ушачский","Толочинский","Сенненский","Россонский",
				"Поставский","Полоцкий","Оршанский","Миорский","Лиозненский","Лепельский","Дубровенский",
				"Докшицкий","Городокский","Глубокский","Витебский","Верхнедвинский","Браславский","Бешенковичский"},
		{"Шкловский","Чериковский","Чаусский","Хотимский","Славгородский","Осиповичский","Мстиславский",
				"Могилёвский","Костюковичский","Круглянский","Кричевский","Краснопольский","Кличевский",
				"Климовичский","Кировский","Дрибинский","Горецкий","Глусский","Быховский","Бобруйский","Белыничский"},
		{"Чечерский район","Хойникский район","Светлогорский район","Рогачёвский район","Речицкий район",
				"Петриковский район","Октябрьский район","Наровлянский район","Мозырский район","Лоевский район",
				"Лельчицкий район","Кормянский район","Калинковичский район","Жлобинский район","Житковичский район",
				"Ельский район","Добрушский район","Гомельский район","Ветковский район","Буда-Кошелёвский район","Брагинский район"},
		{"Червенский","Узденский","Столбцовский","Стародорожский","Солигорский","Смолевичский[4]","Слуцкий",
				"Пуховичский","Несвижский","Мядельский","Молодечненский","Минский","Любанский","Логойский",
				"Крупский","Копыльский","Клецкий","Дзержинский","Воложинский","Вилейский","Борисовский","Березинский"}},
			{{"Барановичи", "Береза", "Брест", "Ганцевичи", "Дрогичин", "Жабинка", "Иваново", "Ивацевичи",
				"Каменец", "Кобрин", "Лунинец", "Ляховичи", "Малорита", "Пинск", "Пружаны", "Столин"},
			{"Щучин","Сморгонь","Слоним","Свислочь","Островец","Ошмяны","Новогрудок","Мосты","Лида",
					"Кореличи","Ивье","Зельва","Дятлово","Гродно","Вороново","Волковыск","Большая Берестовица"},
			{"Шумилино","Шарковщина","Чашники","Ушачи","Толочин","Сенно","Россоны","Поставы","Полоцк","Орша",
					"Миоры","Лиозно","Лепель","Дубровно","Докшицы","Городок","Глубокое","Витебск",
					"Верхнедвинск","Браслав","Бешенковичи"},
			{"Шклов","Чериков","Чаусы","Хотимск","Славгород","Осиповичи","Мстиславль","Могилёв","Костюковичи","Круглое",
					"Кричев","Краснополье","Кличев","Климовичи","Кировск","Дрибин","Горки","Глуск","Быхов","Бобруйск","Белыничи"},
			{"Чечерск","Хойники","Светлогорск","Рогачёв","Речица","Петриков","Октябрьский","Наровля","Мозырь","Лоев",
					"Лельчицы","Корма","Калинковичи","Жлобин","Житковичи","Ельск","Добруш","Гомель","Ветка","Буда-Кошелёво","Брагин"},
			{"Червень","Узда","Столбцы","Старые Дороги","Солигорск","Смолевичи","Слуцк","Марьина Горка","Несвиж","Мядель",
					"Молодечно","Минск","Любань","Логойск","Крупки","Копыль","Клецк","Дзержинск","Воложин","Вилейка","Борисов","Березино"}}};
	
	public Logic() {
	}
	
	public void generateCountry(Country country) {
		country.setName("Беларусь");
		country.setCountryCapitalName("Минск");
		generateRegions(country);
		
	}
	public void generateRegions(Country country) {
		Region tempRegion;
		for(int i = 0; i < regions[0].length; i++) {
			tempRegion = new Region(country);
			tempRegion.setName(regions[0][i]);
			tempRegion.setRegionCapitalName(regions[1][i]);
			country.getRegions().add(tempRegion);
			generateDistricts(tempRegion, i);
		}
	}
	public void generateDistricts(Region region, int regIndex) {
		District tempDistrict;
		for(int i = 0; i < districts[0][regIndex].length; i++) {
			tempDistrict = new District(region);
			tempDistrict.setName(districts[0][regIndex][i]);
			tempDistrict.setDistrictCapitalName(districts[0][regIndex][i]);
			region.getDistricts().add(tempDistrict);
		}
	}
	public void generateCities(District district) {
		City tempCity;
		for (int i = 0; i < 10; i++) {
			tempCity = new City(district);
			tempCity.setName("City " + i);
		}
	}
}
